<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"199c87ed59ef7fb1bdaa2ae5c1a8f287d7dc1f923a068674e166b2e1a4ecc7fa","plan_job_ref":"Job Plan Airflow DAGs #476 at https://github.com/cal-itp/data-infra/actions/runs/16945959388","plan_out_hash":"9bb83bfea12938b0b3ae0c869ad423fbdaf8230353ec3e0b5440f61bc45a551a","plan_hash":"ca77da180195f2ef3bff03a7cec0133f3c1e0b5b1aaf4b6d0c2bfc5cbcdacce1","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-dags["models/mart/benefits/fct_benefits_events.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "YjOIXw==" -> (known after apply)
!~      detect_md5hash      = "as6RfOH2oZKs7Yaae+ZE0g==" -> "different hash"
!~      generation          = 1754938421548609 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/benefits/fct_benefits_events.sql"
!~      md5hash             = "as6RfOH2oZKs7Yaae+ZE0g==" -> (known after apply)
        name                = "data/warehouse/models/mart/benefits/fct_benefits_events.sql"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #476](https://github.com/cal-itp/data-infra/actions/runs/16945959388)